In [1]:
import sqlite3

In [2]:
con = sqlite3.connect("mydatabase.db")

In [3]:
cursor = con.cursor()

In [4]:
cursor.execute("CREATE TABLE employee (emp_id INT PRIMARY KEY,first_name VACHAR(40),last_name VACHAR(40),birth_day DATE,sex VARCHAR(1),salary INT,super_id INT,branch_id INT)")
con.commit()

In [5]:
cursor.execute("CREATE TABLE branch(branch_id INT PRIMARY KEY,branch_name VARCHAR(40),mgr_id INT,mgr_start_date DATE)")
#cursor.execute("FOREIGN KEY(mgr_id) REFERENCES employee(emp_id) ON DELETE SET NULL")
con.commit()

In [6]:
("FOREIGN KEY(mgr_id) REFERENCES employee(emp_id) ON DELETE SET NULL")
con.commit()

In [7]:
#Adding the branch_id as foreign key
("ALTER TABLE employee (ADD FOREIGN KEY(branch_id) REFERENCES branch(branch_id) ON DELETE SET NULL")
con.commit()

In [8]:
#Adding the super_id as foreign key
("ALTER TABLE employee (ADD FOREIGN KEY(super_id) REFERENCES employee(emp_id) ON DELETE SET NULL")
con.commit()

In [9]:
cursor.execute("CREATE TABLE client (client_id INT PRIMARY KEY, client_name VARCHAR(40),branch_id INT)")
con.commit()

In [10]:
("FOREIGN KEY(branch_id) REFERENCES branch(branch_id) ON DELETE SET NULL")
con.commit()

In [11]:
cursor.execute("CREATE TABLE branch_supplier(branch_id INT, supplier_name VARCHAR(40),supply_type VARCHAR(40), PRIMARY KEY(branch_id, supplier_name))")
con.commit()

In [12]:
("FOREIGN KEY(branch_id) REFERENCES branch(branch_id) ON DELETE CASCADE")
con.commit()

In [13]:
cursor.execute ("INSERT INTO employee VALUES(100, 'David', 'Wallace', '1967-11-17', 'M', 250000, NULL, NULL)")
con.commit()

In [14]:
cursor.execute ("INSERT INTO branch VALUES(1, 'Corporate', 100, '2006-02-09') ")
con.commit()

In [15]:
cursor.execute ("UPDATE employee SET branch_id = 1 WHERE emp_id = 100")
con.commit()

In [16]:
cursor.execute ("INSERT INTO employee VALUES(102, 'Michael', 'Scott', '1964-03-15', 'M', 75000, 100, NULL)")

cursor.execute ("INSERT INTO branch VALUES(2, 'Scranton', 102, '1992-04-06')")

con.commit()

In [17]:
cursor.execute ("UPDATE employee SET branch_id = 2 WHERE emp_id = 102")
con.commit()

In [18]:
cursor.execute ("INSERT INTO employee VALUES(103, 'Angela', 'Martin', '1971-06-25', 'F', 63000, 102, 2)")
con.commit()

In [19]:
cursor.execute ("INSERT INTO branch_supplier VALUES(2, 'Hammer Mill', 'Paper')")
cursor.execute ("INSERT INTO branch_supplier VALUES(2, 'Uni-ball', 'Writing Utensils')")
cursor.execute ("INSERT INTO branch_supplier VALUES(3, 'Patriot Paper', 'Paper')")
cursor.execute ("INSERT INTO branch_supplier VALUES(2, 'J.T. Forms & Labels', 'Custom Forms')")
cursor.execute ("INSERT INTO branch_supplier VALUES(3, 'Uni-ball', 'Writing Utensils')")
cursor.execute ("INSERT INTO branch_supplier VALUES(3, 'Hammer Mill', 'Paper')")
cursor.execute ("INSERT INTO branch_supplier VALUES(3, 'Stamford Lables', 'Custom Forms')")
con.commit()

In [28]:
# CLIENT
cursor.execute ("REPLACE INTO client VALUES(400, 'Dunmore Highschool', 2)")
cursor.execute ("REPLACE INTO client VALUES(401, 'Lackawana Country', 2)")
cursor.execute ("REPLACE INTO client VALUES(402, 'FedEx', 3)")
cursor.execute ("REPLACE INTO client VALUES(403, 'John Daly Law, LLC', 3)")
cursor.execute ("REPLACE INTO client VALUES(404, 'Scranton Whitepages', 2)")
cursor.execute ("REPLACE INTO client VALUES(405, 'Times Newspaper', 3)")
cursor.execute ("REPLACE INTO client VALUES(406, 'FedEx', 2)")
con.commit()

In [25]:
# CLIENT
cursor.execute ("INSERT INTO client VALUES(600, 'Dunmore Highschool', 2)")
cursor.execute ("INSERT INTO client VALUES(601, 'Lackawana Country', 2)")
cursor.execute ("INSERT INTO client VALUES(602, 'FedEx', 3)")
cursor.execute ("INSERT INTO client VALUES(603, 'John Daly Law, LLC', 3)")
cursor.execute ("INSERT INTO client VALUES(604, 'Scranton Whitepages', 2)")
cursor.execute ("INSERT INTO client VALUES(605, 'Times Newspaper', 3)")
cursor.execute ("INSERT INTO client VALUES(606, 'FedEx', 2)")
con.commit()

In [22]:
cursor.execute ("CREATE TABLE works_with (emp_id INT, client_id INT, total_sales INT, PRIMARY KEY(emp_id, client_id))")
("FOREIGN KEY(emp_id) REFERENCES employee(emp_id) ON DELETE CASCADE")
("FOREIGN KEY(client_id) REFERENCES client(client_id) ON DELETE CASCADE")
con.commit()

In [23]:
# WORKS_WITH
cursor.execute ("INSERT INTO works_with VALUES(105, 400, 55000)")
cursor.execute ("INSERT INTO works_with VALUES(102, 401, 267000)")
cursor.execute ("INSERT INTO works_with VALUES(108, 402, 22500)")
cursor.execute ("INSERT INTO works_with VALUES(107, 403, 5000)")
cursor.execute ("INSERT INTO works_with VALUES(108, 403, 12000)")
cursor.execute ("INSERT INTO works_with VALUES(105, 404, 33000)")
cursor.execute ("INSERT INTO works_with VALUES(107, 405, 26000)")
cursor.execute ("INSERT INTO works_with VALUES(102, 406, 15000)")
cursor.execute ("INSERT INTO works_with VALUES(105, 406, 130000)")
con.commit()

In [29]:
cursor.execute ('SELECT * FROM employee')
rows = cursor.fetchall()
rows

[(100, 'David', 'Wallace', '1967-11-17', 'M', 250000, None, 1),
 (102, 'Michael', 'Scott', '1964-03-15', 'M', 75000, 100, 2),
 (103, 'Angela', 'Martin', '1971-06-25', 'F', 63000, 102, 2)]

In [30]:
cursor.execute ('SELECT * FROM client')
rows = cursor.fetchall()
rows

[(600, 'Dunmore Highschool', 2),
 (601, 'Lackawana Country', 2),
 (602, 'FedEx', 3),
 (603, 'John Daly Law, LLC', 3),
 (604, 'Scranton Whitepages', 2),
 (605, 'Times Newspaper', 3),
 (606, 'FedEx', 2),
 (400, 'Dunmore Highschool', 2),
 (401, 'Lackawana Country', 2),
 (402, 'FedEx', 3),
 (403, 'John Daly Law, LLC', 3),
 (404, 'Scranton Whitepages', 2),
 (405, 'Times Newspaper', 3),
 (406, 'FedEx', 2)]

In [31]:
cursor.execute ('SELECT * FROM works_with')
rows = cursor.fetchall()
rows

[(105, 400, 55000),
 (102, 401, 267000),
 (108, 402, 22500),
 (107, 403, 5000),
 (108, 403, 12000),
 (105, 404, 33000),
 (107, 405, 26000),
 (102, 406, 15000),
 (105, 406, 130000)]

In [32]:
cursor.execute ('SELECT DISTINCT sex FROM employee')
rows = cursor.fetchall()
rows

[('M',), ('F',)]

In [33]:
cursor.execute (' SELECT COUNT(emp_id) FROM employee')
cursor.fetchall()

[(3,)]

In [34]:
cursor.execute (' SELECT COUNT(super_id) FROM employee')
cursor.fetchall()

[(2,)]

In [35]:
# find the number of female employees born after 1970
cursor.execute ("SELECT COUNT (emp_id) FROM employee WHERE sex = 'F' AND birth_day > '1970-01-01' ")
cursor.fetchall()

[(1,)]

In [36]:
# Find all employee's id's and names who were born after 1969
cursor.execute ("SELECT emp_id, first_name AS forname, last_name AS surname FROM employee WHERE birth_day >= '1970-01-01' ")
cursor.fetchall()

[(103, 'Angela', 'Martin')]

In [37]:
#Find all female employees at branch 2
cursor.execute ("SELECT * FROM employee WHERE branch_id = 2 AND sex = 'F' ")
cursor.fetchall()

[(103, 'Angela', 'Martin', '1971-06-25', 'F', 63000, 102, 2)]

In [38]:
#Find all employees who are female & born after 1969 or who make over 80000
cursor.execute ("SELECT * FROM employee WHERE (birth_day >= '1970-01-01' AND sex = 'F') OR salary > 80000")
cursor.fetchall()

[(100, 'David', 'Wallace', '1967-11-17', 'M', 250000, None, 1),
 (103, 'Angela', 'Martin', '1971-06-25', 'F', 63000, 102, 2)]

In [39]:
# Find all employees born between 1970 and 1975
cursor.execute ("SELECT * FROM employee WHERE birth_day BETWEEN '1970-01-01' AND '1975-01-01'")
cursor.fetchall()

[(103, 'Angela', 'Martin', '1971-06-25', 'F', 63000, 102, 2)]

In [40]:
#Find all employees named Jim, Michael, Johnny or David
cursor.execute ("SELECT * FROM employee WHERE first_name IN ( 'Michael', 'David')")
cursor.fetchall()

[(100, 'David', 'Wallace', '1967-11-17', 'M', 250000, None, 1),
 (102, 'Michael', 'Scott', '1964-03-15', 'M', 75000, 100, 2)]

In [41]:
#find the avg salary of all employee
cursor.execute (" SELECT AVG(salary) FROM employee")
cursor.fetchone()

(129333.33333333333,)

In [42]:
#find the avg salary where employee is female
cursor.execute ("SELECT AVG(salary) FROM employee WHERE sex = 'F' ")
cursor.fetchone()

(63000.0,)

In [43]:
#Find the sum of all employee's salaries
cursor.execute ("SELECT SUM(salary) FROM employee")
cursor.fetchone()

(388000,)

In [44]:
#Find out how many males and females there are
cursor.execute ("SELECT COUNT(sex), sex FROM employee GROUP BY sex")
cursor.fetchall()

[(1, 'F'), (2, 'M')]

In [45]:
#Find the total sales of each salesman
cursor.execute ("SELECT SUM(total_sales) AS sales, emp_id FROM works_with GROUP BY emp_id")
cursor.fetchall()

[(282000, 102), (218000, 105), (31000, 107), (34500, 108)]

In [46]:
#To find out how much each client spent on the company
cursor.execute ("SELECT SUM(total_sales), emp_id FROM works_with GROUP BY client_id")
cursor.fetchall()

[(55000, 105),
 (267000, 102),
 (22500, 108),
 (17000, 107),
 (33000, 105),
 (26000, 107),
 (145000, 102)]

In [47]:
 # the % sign in query rep any number of character
#Find any client's who are in LLC
cursor.execute ("SELECT * FROM client WHERE client_name LIKE '%LLC' ")
cursor.fetchall()

[(603, 'John Daly Law, LLC', 3), (403, 'John Daly Law, LLC', 3)]